<template>
    <xe-layout>
        <div class="m-support-con">
            <div class="m-support-top">
                <h3>如来云商身份认证服务协议</h3>
                <p>身份认证服务协议（以下简称“本协议”）所述内容是身份认证服务是由河南如来云商络科技有限公司 （以下简称“如来云商/本公司”）提供如来云商用户（以下简称“用户”）身份认证服务所达成的协议。</p>
            </div>
            <div>
                <div class="m-support-item" v-for="(item, index) in itemData" :key="index">
                    <div class="m-list-block" @click.prevent="item.show = !item.show">
                        <ul>
                            <li class="item-content item-link">
                                <div class="item-inner">
                                    <div class="item-title f32">{{item.title}}</div>
                                </div>
                            </li>
                        </ul>
                    </div>
                    <CollapseTransition>
                        <div class="m-support-text" v-show="item.show">
                            <p v-for="(content, cindex) in item.content" :key="cindex" v-html="content.text">
                            </p>
                        </div>
                    </CollapseTransition>
                </div>
            </div>
        </div>
        <div class="person-repeat">
            <mt-button class="xe-button-primary" @click.prevent="goBackFn">返回</mt-button>
        </div>
    </xe-layout>
</template>
<script type="text/ecmascript-6">
    import CollapseTransition from 'utils/collapse-transition';
    export default {
        name: 'xe-page-authSupport',
        data() {
            return {
                itemData: [
                    {
                        show: false,
                        title: '一、接受条款',
                        content: [
                            {
                                text: '1.除非用户已阅读并接受本协议所有条款，否则无法完成如来云商实名认证服务。如果用户申请如来云商的身份认证并使用了提交身份信息、进行身份验证等服务，即表示用户已充分阅读、理解并同意接受本协议的约束。 '
                            },
                            {
                                text: '2.用户必须是能够独立承担相应法律责任的自然人、法人或其他组织。若用户不具备此资格，身份认证信息无效。'
                            },
                            {
                                text: '3.如来云商有权随时更新本协议，并且本协议的每次更新只需对变更事项网站内公告，无需单独通知用户。如果用户拒绝接受新的协议，用户必须放弃使用如来云商提供的服务；若用户继续使用如来云商提供的服务，则表明用户理解、认可并接受新的协议。'
                            },
                            {
                                text: '4.用户需要严格按照身份认证协议规定以及如来云商对于身份认证的要求，进行实名认证，未经实名认证的无法完成相关交易行为。如来云商有权根据实际情况随时调整身份认证服务的服务内容，无需事先征得用户的同意且无需因此向任何人承担责任。'
                            },
                            {
                                text: '5.如来云商或者如来云商委托第三方审核机构，对用户进行身份认证。对于能够实现身份认证功能的其他银行卡认证、其他网站认证等认证工具，用户同意如来云商将用户其他认证工具中的的注册信息及身份认证信息同步至如来云商并允许其使用，并且用户不会因此追究如来云商的责任。如来云商关联公司经如来云商授权可以使用用户身份认证信息。5.如来云商或者如来云商委托第三方审核机构，对用户进行身份认证。对于能够实现身份认证功能的其他银行卡认证、其他网站认证等认证工具，用户同意如来云商将用户其他认证工具中的的注册信息及身份认证信息同步至如来云商并允许其使用，并且用户不会因此追究如来云商的责任。如来云商关联公司经如来云商授权可以使用用户身份认证信息。5.如来云商或者如来云商委托第三方审核机构，对用户进行身份认证。对于能够实现身份认证功能的其他银行卡认证、其他网站认证等认证工具，用户同意如来云商将用户其他认证工具中的的注册信息及身份认证信息同步至如来云商并允许其使用，并且用户不会因此追究如来云商的责任。如来云商关联公司经如来云商授权可以使用用户身份认证信息。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '二、用户的权利义务 ',
                        content: [
                            {
                                text: '1.用户应保证其提供给如来云商的所有资料和信息的真实性、合法性、准确性和有效性。如用户提供服务或内容需要取得相关法律法规规定的许可或进行备案的，用户应当主动进行明确说明并提交相应的许可或备案证明。否则，如来云商有权随时决定用户身份认定无效，因用户提供无效身份信息给如来云商或第三方造成损害的，用户应当依法予以赔偿。 '
                            },
                            {
                                text: '2.用户同意授权如来云商或如来云商委托的第三方机构对其提交的进行甄别核实，并进行必要查阅、使用及保存上述资料及信息。如来云商有权针对资质审核事宜与用户进行联系与沟通，用户应当配合在资质审核过程中所提出的相关需求。'
                            },
                            {
                                text: '3.用户不得通过非如来云商授权的其他任何渠道使用本服务，如非因如来云商故意或重大过失原因导致的认证失败、认证流程过长等后果，如来云商不承担任何责任。'
                            },
                            {
                                text: '4.用户理解并且同意，用户提交的资料和信息是作出认证结果的重要依据，任何资料和信息的变更将可能影响认证结果，用户应当在资料和信息变更时及时提出补充认证申请，否则如来云商有权依照本协议约定随时决定用户身份认证无效，如来云商因此遭受损失的，用户也应当一并赔偿。'
                            },
                            {
                                text: '5.用户身份认证成功后，如来云商有权以认证帐号名称和认证信息所公示的身份展示用户信息，并通过认证标识区别于其他非认证用户。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '三、如来云商的权利义务',
                        content: [
                            {
                                text: '1.保护用户信息是如来云商的一项基本原则，如来云商将会采取合理的措施保护用户所提交的一切资料及信息。除法律法规规定、以及如来云商相关协议约定的情形外，未经用户许可如来云商不会向其他第三方公开、透露上述资料及信息。'
                            },
                            {
                                text: '2.如来云商有权根据相关法律法规的规定及行业标准，针对用户的不同认证需求制定不同的资质审核标准及要求，并有权在必要时对相关标准及要求进行修改。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '四、如来云商身份认证规则',
                        content: [
                            {
                                text: '1.如来云商个人用户提供以下证件用于认证：认证当时处在有效期内的身份证、户口本等明确标有身份证号的证件之一。　'
                            },
                            {
                                text: '2.公司、个体工商户、组织机构等商户类如来云商用户向本公司申请认证服务时，应向本公司提供以下资料：工商登记机关颁发的营业执照或组织机构代码证等有效证件、提交授权委托人的身份证件（同本条第1项约定，授权委托人如非法定代表人，应同时提供该单位的授权委托书）。'
                            },
                            {
                                text: '3.法律规定不具有完全民事行为能力的自然人，或者不能独立承担法律责任的公司、个体工商户、组织机构等，本公司不向其提供认证服务。'
                            },
                            {
                                text: '5.如如来云商用户在认证有效期内变更任何身份信息，则应在变更发生后三个工作日内书面通知本公司变更认证，否则本公司有权随时单方终止提供如来云商服务，且因此造成的全部后果，由如来云商用户自行承担。'
                            },
                            {
                                text: '6.对于用户采用银行账户进行身份认证的，个人用户进行认证应提供本人开设的账号、开户名、开户银行。商户类用户应提供其在银行开设的账号、开户名、开户银行。'
                            },
                            {
                                text: '7.如来云商用户填写的银行账户的开户名必须与身份信息中的真实姓名或营业执照、组织机构代码证中的名称完全一致，所有经如来云商用户填写的资料将成为认证资料。'
                            },
                            {
                                text: '8.若如来云商用户提供不实认证资料的方式，使本公司误认为该用户是完全民事行为能力人而受理身份信息识别申请的，则因此产生的一切后果将由该用户及(或)其监护人（或）有独立承担法律责任的上级机构承担，本公司不承担任何责任。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '五、认证资料的管理责任：',
                        content: [
                            {
                                text: '1.用户在认证时提交给本公司的认证资料，即不可撤销的授权由本公司保留。本公司承诺除法定或约定的事由外，不公开或编辑或透露用户的认证资料及保存在本公司的非公开内容用于商业目的，但以下情形除外：1.1用户授权本公司透露的相关信息；1.2本公司向国家司法及行政机关提供1.3本公司向本公司关联企业提供；1.4 第三方和本公司一起为用户提供服务时，该第三方向用户提供服务所需的相关信息（不包括用户的银行账户信息）。1.5 基于解决用户与第三方民事纠纷的需要，本公司有权向该第三方提供用户的身份信息。1.6只有披露用户的个人资料，才能提供用户需要的产品和（或）服务；'
                            },
                            {
                                text: '2.下列情况用户认证资料泄露时本公司无需承担任何责任：2.1由于用户将如来云商账户密码告知他人或未保管好自己的密码或与他人共享如来云商账户或任何其他非本公司的过错，导致用户的个人资料泄露。2.2任何由于黑客攻击、计算机病毒侵入或发作、电信部门技术调整导致之影响、因政府管制而造成的暂时性关闭、由于第三方原因(包括不可抗力，例如国际出口的主干线路及国际出口电信提供商一方出现故障、火灾、水灾、雷击、地震、洪水、台风、龙卷风、火山爆发、瘟疫和传染病流行、罢工、战争或暴力行为或类似事件等)及其他非因本公司过错而造成的认证信息泄露、丢失、被盗用或被篡改等。2.3由于与本公司链接的其它网站（如网上银行等）所造成的银行账户信息泄露及由此而导致的任何法律争议和后果。2.4任何如来云商用户（包括未成年人用户）向本公司提供错误、不完整、不实信息等造成不能通过认证或遭受任何其他损失，概与本公司无关。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '六、法律责任',
                        content: [
                            {
                                text: '1.如果如来云商发现或收到他人举报或投诉用户违反本协议约定的，如来云商有权不经通知随时视行为情节对违规用户的帐号处以包括但不限于终止本服务资质审核、责令用户补充资质审查资料、责令用户修改认证信息、责令用户再次申请认证，强制修改帐号名称及认证信息直至取消认证等措施。'
                            },
                            {
                                text: '2.用户理解并同意，因用户违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，用户应当独立承担责任；如来云商因此遭受损失的，用户也应当一并赔偿。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '七、隐私权保护',
                        content: [
                            {
                                text: '一旦用户同意本协议或使用本服务，用户即同意本公司按照以下条款来使用和披露用户的个人信息。'
                            },
                            {
                                text: '1.在用户注册或激活如来云商账户及服务时，我们会要求用户设置如来云商登录名和密码来识别用户的身份，以便在用户丢失密码时用以确认用户的身份。用户仅可通过用户设置的密码来使用该账户，如果用户泄漏了密码，用户可能会丢失用户的个人识别信息，并可能导致对用户不利的法律后果。该账户和密码因任何原因受到潜在或现实危险时，用户应该立即和本公司取得联系，在本公司采取行动前，本公司对此不负任何责任。'
                            },
                            {
                                text: '2.注册信息用户注册时应提供用户的手机号码和所在地。根据《食品安全法》和《网络交易管理办法》之规定，从事本网站商品交易者需按照本网站之流程完成实名认证。为有针对性地向用户提供新的服务和机会，用户了解并同意本公司将通过用户的联系方式（包括但不限于手机、电子邮件、如来云商客户端、如来云商站内信等）向用户发送相关通知及其他商业性电子信息。'
                            },
                            {
                                text: '3.银行账户信息本公司所提供的服务将需要用户提供用户的银行账户信息，在用户提供相应信息后，本公司将严格履行相关保密约定。'
                            },
                            {
                                text: '4.Cookie的使用及设备软硬件配置信息的收集。用户了解并同意，本公司使用cookie来使本网站对用户更友好（它可以帮用户省去为使用我们的服务而重复输入注册信息和跟踪用户的浏览器的状态），同时，本公司站点会收集由用户设备的软硬件配置信息生成的特征信息，用于标识用户的设备，以便更好地为用户服务。'
                            },
                            {
                                text: '5.为更安全有效地向用户提供服务，根据法律法规的规定，本公司要求所有注册用户全部实名认证，同时本公司认为用户的账户存在风险时，本公司有权要求用户提交身份信息（包括但不限于身份证、户口本、护照等证件）。'
                            },
                            {
                                text: '6.外部链接本网站含有到其他网站的链接，但本公司对其他网站的隐私保护措施不负任何责任。本公司可能在任何需要的时候增加商业伙伴或共用品牌的网站。'
                            },
                            {
                                text: '7.安全本公司仅按现有技术提供相应的安全措施来使本公司掌握的信息不丢失，不被滥用和变造。这些安全措施包括向其它服务器备份数据和对用户密码加密。尽管有这些安全措施，但本公司不保证这些信息的绝对安全。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '八、其他',
                        content: [
                            {
                                text: '1.本协议条款变更后，如果用户继续使用如来云商，即视为用户已接受修改后的协议。如果用户不接受修改后的协议，应当停止使用如来云商服务。'
                            },
                            {
                                text: '2.本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。若用户和如来云商之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，用户同意由河南如来云商络科技有限公司住所地人民法院管辖。'
                            }
                        ]
                    }
                ]
            };
        },
        methods: {
        },
        components: {
            CollapseTransition
        }
    };
</script>
<style rel="stylesheet/scss" lang="scss">
    @import "../../static/styles/rules.scss";
    .m-support-top {
        padding: 40/$ppr 30/$ppr;
        h3 {
            font-size: 38/$ppr;
            font-weight: 600;
            text-align: center;
            margin-bottom: 30/$ppr;
        }
        p {
            margin: 15/$ppr 0;
            font-size: 24/$ppr;
            color: $text-666;
            line-height: 1.5;
        }
    }
    .m-support-item {
        &:first-child {
            border-top: 1/$ppr solid $border-color-e8e;
        }
        .item-content {
            border-bottom: 1/$ppr solid $border-color-e8e;
        }
    }
    .m-support-text {
        padding: 20/$ppr;
        background: #f5f5f5;
        font-size: 28/$ppr;
        p {
            padding: 8/$ppr 0;
            line-height: 1.5;
            color: #666;
        }
    }
    .person-repeat {
        margin: 50/$ppr 20/$ppr 50/$ppr;
        .xe-button-primary {
            background: #f23530;
            color: #fff;
            width: 100%;
            line-height: 40/$ppr;
        }
    }
</style>
