<template>
    <xe-layout>
        <view class="m-support-con boldLine">
            <view class="m-support-top">
                <h3>竞标服务协议</h3>
                <p>最新版本生效日期：2018年【09】月【01】日</p>
                <p>本协议具有合同效力，在您接受本协议之前，请您务必仔细阅读本协议的全部内容，特别是以<strong>粗体下划线</strong>形式提示您注意的条款。如果您对本协议的条款有疑问的，请通过如来云商客服渠道进行询问，如来云商将向您解释条款内容。如果您不同意本协议的任意内容，或者无法准确理解如来云商对条款的解释，请不要进行后续操作。</p>
            </view>
            <view>
                <view class="m-support-item" v-for="(item, index) in itemData" :key="index">
                    <view class="m-list-block" @click.prevent="item.show = !item.show">
                        <ul>
                            <li class="item-content item-link">
                                <view class="item-inner">
                                    <view class="item-title f32">{{item.title}}</view>
                                </view>
                            </li>
                        </ul>
                    </view>
                    <CollapseTransition>
                        <view class="m-support-text" v-show="item.show">
                            <p v-for="(content, cindex) in item.content" :key="cindex" v-html="content.text"></p>
                        </view>
                    </CollapseTransition>
                </view>
            </view>
        </view>
    </xe-layout>
</template>
<script type="text/ecmascript-6">
    import CollapseTransition from 'utils/collapse-transition';
    let txt = `第一条  签约主体
1.1本协议由河南如来云商络科技有限公司（以下简称“如来云商”）与参与竞标的如来云商买家（即“投标人”，以下简称“买家”或“您”）签署。

第二条  立约背景
2.1为维护如来云商提供技术服务支持的招标投标活动的交易秩序，规范买家与卖家（即“招标人”）的招标投标行为，保障双方的合法权益，依据《如来云商用户注册协议》、《【如来云商招标投标活动管理规则】》和现有业务的规定拟定本协议。
2.2如来云商受招投标双方之委托为其提供招标投标的技术服务，如来云商竞标页面上的招标品信息及招标品相关描述（以下统称“招标品信息”）均由卖家自主发布，您通过如来云商查询、浏览招标品信息并参与竞标且通过卖家的评标后竞标成功的，您将受到您与卖家之间达成的买卖合同的约束。
2.3 如来云商上登载的招投标信息及后续的招投标流程由招标人定向或邀请式进行，并非针对全体用户，非定向接收者或被邀请人无权对该等信息进行处理、响应。

第三条  协议生效和适用范围
3.1您通过网络页面点击确认或以其他方式选择接受本协议，即表示您与如来云商已达成协议并同意接受本协议的全部约定内容。本协议自您通过网络页面点击确认或以其他方式选择接受本协议之时起生效。
<strong>3.2本协议内容包括协议正文、附件、《【如来云商招标投标活动管理规则】》以及所有如来云商已经发布的或将来可能发布的各类平台规则、操作流程。所有规则为协议不可分割的一部分，与协议正文具有同等的法律效力。如来云商有权根据需要不时地制定、修改本协议、附件或各类规则、操作流程，如有任何变更，如来云商将在网站上以公示形式通知您。任何修订和新规则及流程一经公布即自动生效，成为本协议的一部分。如您继续参与竞标的，则视为您对修改后的条款不持异议并同意遵守。</strong>

第四条  定义
4.1竞标：是指卖家以招标的方式发布招标品，采用招标投标形式，由竞标成功者最终获得竞标品的交易方式。
4.2竞标成功者：指通过了卖家的评标而在竞标中获胜，最终有权购买竞标品的买家。
4.3竞标营销活动：指如来云商组织的竞标品推广活动，包括日常竞标品活动和节庆促销等主题专场活动。
4.4平台规则：包括在所有如来云商已经发布的或将来可能发布的全部规则、实施细则、产品说明、公告等。

第五条  参与竞标的条件
5.1符合以下条件的买家方能参与竞标：
5.1.1其已确认接受《如来云商用户注册协议》，成为如来云商用户；所有参加投标的买家客户必须签订《如来云商进口期货产品网络招标活动参与招标客户承诺函》（见附件），第一次参加投标的买家中，以自然人身份的需要将签字规范及有红字手印的身份证复印件，公司身份的需要提供加盖公章的公司营业执照并在如来云商进行注册。
5.1.2其已经向如来云商指定的账户缴纳其欲投标的竞标品所要求的保证金，保证金支付账户：公司：河南如来云商络科技有限公司
开户行：中国建设银行长葛支行
账号：41001559810050214097
5.1.3如来云商未拒绝其参与竞标的申请。

第六条  竞标服务及买家义务
6.1如来云商同意向买家提供稳定的投标技术服务，使买家参与的竞标得以顺利进行；买家同意严格按照本协议约定使用招标投标活动的技术服务。
6.2参与竞标的买家可以在竞标结束的24小时后，通过您在如来云商的注册界面查询自己是否中标。
6.3在投标有效期内您确认投标的，根据卖家设置的保证金类型如来云商有权指示存放保证金的银行锁定您缴纳的拍卖保证金；如您符合《【如来云商招标投标活动管理规则】》规定的退回条件时，如来云商有权指示存放保证金的银行把保证金退回到您在《如来云商进口期货产品网络招标活动参与招标客户承诺函》中指定的账户，未中标的将在3个工作日内退回保证金。
6.4您应当按照本协议、附件、《【如来云商招标投标活动管理规则】》以及所有如来云商已经发布的或将来可能发布的各类平台规则、操作流程参与竞标，遵守相关投标、获得招标品、竞标保证金缴纳/退回/赔付等各类规定。
6.5招标品订单确认后，由卖家和中标的买家直接签订产品采购合同，同时也可以委托如来云商指派进口服务商代理签订购销合同。同时，如来云商国际供应链可以为客户提供全程的供应链服务。
<strong>6.6您确认，因部分卖家的招标活动须向有关工商行政管理部门申报并提供买家（含所有参与竞标的买家）的相关身份信息，如您参与竞标的招标品属于该部分卖家提供的招标品，则您同意将您的身份信息（包含但不限于姓名、身份证件号码、住址等）提供给卖家用于卖家向工商行政管理部门申报之用，具体提供方式为：在您签署本协议后，在网络页面中填写相关身份信息。</strong>

第七条  买家中标不买的责任
7.1竞标成功后，买家须按照规定完成交易，不得中标不买。买家若发生以下任一情形，将视为中标不买，但买卖双方另有约定或卖家原因导致的除外：
7.1.1买家在中标后的3 个工作日内未支付该招标活动规定比例的预付款到指定的账户；
7.1.2在竞标成功且付款后，买家申请退款（招标品支持7天无理由退货除外）。
7.2为了维护如来云商招标投标活动的交易秩序，防止买家恶意竞标，尽量避免并妥善处理买卖双方之间的交易纠纷，您参与竞标时缴纳的保证金将为本次竞标提供保障。<strong>如您出现中标不买的行为，您同意如来云商有权指示存放保证金的银行划扣您的竞标保证金用于赔付卖家；且如来云商仍有权按照相关规则的规定对您进行处理。 </strong>

第八条  协议终止
8.1本协议在符合以下任意一项情形时终止：
8.1.1买家未竞标成功的，本协议自保证退回之时起终止；
8.1.2买家竞标成功且未出现中标不买情形的，本协议自交易成功之时起终止；
8.1.3买家竞标成功且卖家在买家付款前关闭交易订单的，本协议自订单关闭且保证金退回之时起终止；
8.1.4如买家在线签署的《如来云商用户注册协议》因任何原因终止，则本协议将同时终止；
8.1.5本协议（含规则）调整时，您明示并通知如来云商不愿接受新的协议内容，则本协议自如来云商收到您通知之日起终止；
<strong>8.1.6如来云商有权提前15天以书面通知的方式终止本协议；</strong>
8.1.7其他协议终止条件发生或实现，导致本协议终止。

第九条  免责及有限责任
9.1本协议项下的招标投标活动的技术服务将按“现状”和按“可得到”的状态提供，如来云商将在现有技术的基础上尽最大努力提供相应的安全措施以保障服务安全和正常运行。但<strong>由于可能存在的计算机病毒、网络通讯故障、系统维护等方面的因素以及可能发生的不可抗力事件，如来云商在此明确声明对技术服务不作任何明示或暗示的保证，包括但不限于对服务的可适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。</strong>对此买家予以理解并不应要求如来云商在以下情况下承担责任：
9.1.1系统停机维护；
9.1.2通讯终端或电信设备出现故障不能进行数据传输的；
9.1.3因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成系统障碍不能提供服务的；
9.1.4由于黑客攻击、电信部门技术调整或故障、网站升级、第三方问题等原因而造成的服务中断或者延迟。
<strong>9.2如来云商仅向您提供招标投标活动的技术信息服务以便您与卖家之间达成招标品的相关交易，如来云商并非交易的参与方，不对卖家的任何口头、书面陈述或者向如来云商上传的线上信息及招标品之真实性、合法性做任何明示或暗示的担保，或对此承担任何责任。如因招标品交易产生纠纷的，均由卖家以自己的名义独立承担所有相应的法律责任。</strong>

第十条  其他约定
10.1本协议适用中华人民共和国大陆地区的法律、法规，如无相关规定的，则应参照通用中华人民共和国商业惯例和（或）行业惯例。
<strong>10.2因如来云商与您就本协议的签订、履行或解释发生争议，双方应尽力友好协商解决；协商不成时，如来云商和您同意由如来云商住所地法院管辖审理双方的纠纷或争议。</strong>
<strong>10.3 招投标双方因招投标合同发生争议的，不应当将如来云商列为争议主体，届时如来云商有权引用本条作为主体不适格抗辩，任何一方对此将不持异议。</strong>

附件1：
<b>如来云商进口期货产品网络招标活动参与招标客户承诺函（个人户）</b>
河南如来云商络科技有限公司：
我是经营                 为主的个体商户，我同意使用如来云商进口期货产品网络招标平台参与网上招投标活动。代表我参与此次招投标活动的微信账号为            。
我保证认真阅读并执行贵司的《招标文件》与招标方案，遵守如来云商进口期货产品招投标说明书的相关规定，并承诺每次通过我的用户名          提供的任何信息（包括但不限于个人基本信息、投标文件、商务报价等），对我均具有法律效力。
如果在竞标过程中出现停电、网络故障等意外状况，无法正常参与网络竞标，我将通过手机短信参加竞标，手机号码为                 。
如本次招标未中标，申请所交纳的投标保证金，退回以下账号（户名必须是本人、并附身份证复印件，开户行名称、账号必须准确，且与交纳时相同）：
户&nbsp;&nbsp;&nbsp;名：     &nbsp;
开户行：     &nbsp;
卡&nbsp;&nbsp;&nbsp;号：     &nbsp;
（附件：摁指纹的身份证复印件）
客户签字（指纹）：
日   期：

附件2：
<b>如来云商进口期货产品网络招标活动参与招标客户承诺函（公司户）</b>
河南如来云商络科技有限公司：
我司                        （全称）是依据国家相关法律、法规成立的以经营                 为主的企业，法定代表人为          。我司同意使用如来云商进口期货产品网络招标平台参与网上招投标活动。代表我司在本次招标中的参与微信账号为               。
我公司保证认真阅读并执行贵司的《招标文件》与招标方案，遵守如来云商进口期货产品招投标说明书的相关规定，并承诺每次通过我司用户名        提供的任何信息（包括但不限于公司基本信息、投标文件、商务报价等），对我司均具有法律效力。
如果网络竞标过程中出现停电、网络故障等意外状况，无法正常参与网络竞标，我公司将通过手机短信参加竞标，手机号码为                 。
如本次招标未中标，申请所交纳的投标保证金退回以下账号（户名必须是本公司，开户行名称、账号必须准确，且与交纳时相同）：
户&nbsp;&nbsp;&nbsp;名：     &nbsp;
开户行：     &nbsp;
卡&nbsp;&nbsp;&nbsp;号：     &nbsp;
（附件：加盖公章的营业执照复印件）
公司名称（签章）：
法定代表人签字：
日  期：
`;
    export default {
        name: 'xe-page-support',
        data() {
            return {
                itemData: []
            };
        },
        created() {
            this.itemDataFn();
        },
        methods: {
            itemDataFn() {
                let resText = txt.split(/\n\s*\n/g);
                let resArr = [];
                resText.forEach(item => {
                    let txtSplit = item.split(/\n/g);
                    let txtContent = [];
                    txtSplit.forEach((item, index) => {
                        if (index !== 0) {
                            txtContent.push({
                                text: item.replace(/\s{4,}/g, `<strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong>`)
                            });
                        }
                    });
                    resArr.push({
                        show: false,
                        title: txtSplit[0].trim(),
                        content: txtContent
                    });
                });
                this.itemData = resArr;
            }
        },
        components: {
            CollapseTransition
        }
    };
</script>
<style rel="stylesheet/scss" lang="scss">
    @import "../../static/styles/rules.scss";
    .m-support-top {
        padding: 40/$ppr 30/$ppr;
        h3 {
            font-size: 38/$ppr;
            font-weight: 600;
            text-align: center;
            margin-bottom: 30/$ppr;
        }
        p {
            margin: 15/$ppr 0;
            font-size: 24/$ppr;
            color: $text-666;
            line-height: 1.5;
        }
    }
    .m-support-item {
        &:first-child {
            border-top: 1/$ppr solid $border-color-e8e;
        }
        .item-content {
            border-bottom: 1/$ppr solid $border-color-e8e;
        }
    }
    .m-support-text {
        padding: 20/$ppr;
        background: #f5f5f5;
        font-size: 28/$ppr;
        p {
            padding: 8/$ppr 0;
            line-height: 1.5;
            color: #666;
        }
    }
</style>
