<template>
    <xe-layout>
        <view class="m-support-con boldLine">
            <view class="m-support-top">
                <h3>招标服务协议</h3>
                <p>最新版本生效日期：2018年【09】月【01】日</p>
                <p>本协议具有合同效力，在您接受本协议之前，请您务必仔细阅读本协议的全部内容，特别是以<strong>粗体下划线</strong>形式提示您注意的条款。如果您对本协议的条款有疑问的，请通过如来云商客服渠道进行询问，如来云商将向您解释条款内容。如果您不同意本协议的任意内容，或者无法准确理解如来云商对条款的解释，请不要进行后续操作。</p>
            </view>
            <view>
                <view class="m-support-item" v-for="(item, index) in itemData" :key="index">
                    <view class="m-list-block" @click.prevent="item.show = !item.show">
                        <ul>
                            <li class="item-content item-link">
                                <view class="item-inner">
                                    <view class="item-title f32">{{item.title}}</view>
                                </view>
                            </li>
                        </ul>
                    </view>
                    <CollapseTransition>
                        <view class="m-support-text" v-show="item.show">
                            <p v-for="(content, cindex) in item.content" :key="cindex" v-html="content.text"></p>
                        </view>
                    </CollapseTransition>
                </view>
            </view>
        </view>
    </xe-layout>
</template>
<script type="text/ecmascript-6">
    import CollapseTransition from 'utils/collapse-transition';
    let txt = `第一条  签约主体
    1.1本协议由河南如来云商络科技有限公司（以下简称“如来云商”）与参与招标的如来云商卖家（即“招标人”，以下简称“卖家”或“您”）签署。

    第二条  立约背景
    2.1为了规范招标投标活动中卖家的行为，明确卖家义务，营造规范、有序的招标投标活动的交易秩序，保障如来云商用户的合法权益，依据《如来云商用户注册协议》、《【如来云商招标投标活动管理规则】》和现有业务的规定拟定本协议。
    2.2如来云商受招投标双方之委托为其提供招标投标的技术服务，如来云商竞标页面上的招标品信息及招标品相关描述（以下简称“招标品信息”）均由卖家自主发布，买家通过如来云商查询、浏览招标品信息并参与竞标且通过卖家的评标后竞标成功的，将受到与卖家之间达成的买卖合同的约束。
    2.3如来云商上登载的招投标信息及后续的招投标流程由招标人定向或邀请式进行，并非针对全体用户，非定向接收者或被邀请人无权对该等信息进行处理、响应。

    第三条  协议生效和适用范围
    <strong>3.1您通过网络页面点击确认或以其他方式选择接受本协议，即表示您与如来云商已达成协议并同意接受本协议的全部约定内容。</strong>
    <strong>3.2本协议内容包括协议正文、《【如来云商招标投标活动管理规则】》以及所有如来云商已经发布的或将来可能发布的各类平台规则、操作流程。所有规则为协议不可分割的一部分，与协议正文具有同等的法律效力。如来云商有权根据需要不时地制定、修改本协议、附件或各类规则、操作流程，如有任何变更，如来云商将在网站上以公示形式通知您。任何修订和新规则及流程一经公布即自动生效，成为本协议的一部分。如您继续参与招标的，则视为您对修改后的条款不持异议并同意遵守。</strong>

    第四条  入驻
    4.1您应当符合招标活动的准入条件，按照入驻流程申请入驻招标活动。
    4.2如来云商对您在入驻环节填写或提交的入驻材料、入驻信息<strong>进行备案</strong>，但如来云商保留抽查、要求您补充提交、及时更新入驻材料及入驻信息的权利；如如来云商发现您入驻资质造假的，如来云商有权立即终止本协议并根据《【如来云商招标投标活动管理规则】》对您进行处罚。

    第五条  招标品发布
    5.1您应当根据招标品发布规则及流程发布招标品及/或专场。如如来云商发现您售卖的招标品资质造假或不符合买方市场的国家标准，如来云商有权立即终止本协议并根据《【如来云商招标投标活动管理规则】》对您进行处罚。
    5.2就您发布的专场及/或招标品，如来云商有权根据实际情况决定是否予以排期，亦有权取消或调整排期时间。

    第六条  费用规定
    6.1作为您使用如来云商提供的招标活动技术服务的代价，您应当按照如下约定向如来云商支付费用：
    6.1.1交易技术服务费：如您发布的招标品交易成功（即招标品订单状态显示为“交易成功”）的，您同意向如来云商支付交易技术服务费（“交易技术服务费”的计算基准为您通过招标活动交易成功的招标品成交价总额），交易技术服务费的收费标准以招标活动收费规则的规定为准。<strong>您授权如来云商在您的如来云商账户每收到一笔招标活动的招标品成交款时，自动自您的如来云商账户按照交易技术服务费的收费标准向如来云商实时支付交易技术服务费。</strong>
    6.1.2上拍技术服务费：如您的招标品出现未达到开标要求的最少投标人数、您主动关闭交易订单或买家确认收货前的交易退款（含部分退款）成功的，您均同意向如来云商支付上拍技术服务费，上拍技术服务费的收费标准以招标活动收费规则的规定为准。<strong>您授权如来云商在您的招标品出现未达到开标要求的最少投标人数、您主动关闭交易订单或买家确认收货前交易退款（含部分退款）成功的情形之时，自动自您的如来云商钱包账户里的上拍技术服务费保证金中，按照上拍技术服务费的收费标准向如来云商实时支付上拍技术服务费。</strong>
    <strong>6.2如来云商按照协议约定向您收取交易技术服务费、上拍技术服务费的行为并不意味着如来云商对您的入驻资质、招标品资质、招标品、交易或您自行上传的其他信息的真实性、准确性、合法性、有效性承担任何明示或暗示的保证或担保等责任，也不意味着如来云商成为您与中标买家之间就招标品竞标、交易的参与方，因您的行为导致的任何投诉、纠纷、争议、赔偿等，您应以自己的名义独立承担所有法律责任。</strong>
    <strong>6.3招标品成交款、未达到开标要求的最少投标人数、交易成功、订单关闭、退款成功等情况以如来云商系统记录的数据及如来云商的判断为准。如出现协议中止、终止或解除等情形的，均不影响如来云商已经收取的技术服务费，您同意如来云商已经收取的技术服务费在任何情况下都不予退回。</strong>
    6.4如来云商支付服务为您向中标买家收取拍卖成交款的唯一支付工具，您不得以任何方式转移或者掩盖实际的招标品成交金额，达到逃避支付服务费的目的。
    6.5双方应于一个自然月结束后核对上月服务费金额，并于核对后的5个工作日内由如来云商向您出具相应服务费发票。

    第七条  保证金
    7.1您应当缴纳经营保证金及上拍技术服务费保证金，保证金的缴纳标准、时限、补缴、释放、管理使用等以招标活动保证金规则的规定为准。前述保证金应缴纳于您的如来云商账户，且止付锁定于您的如来云商账户内。

    第八条  消费者保障服务
    8.1您根据本协议约定的条款和条件及如来云商其他公示规则的规定，通过招标活动平台发布和出售招标品时，应履行商品如实描述义务，在招标品详情页面等所有如来云商提供的渠道中，对上传于如来云商招标活动页面的商品信息进行如实描述，包括但不限于对商品的基本属性、成色、瑕疵等必须说明的信息进行真实、准确、完整的描述，并对描述的商品信息负有举证责任。
    8.2您应当在法定或如来云商指定期间内保障中标买家在商品与网上描述不符、商品存在质量问题、未履行售后服务情形下的权益。当发生中标买家主张商品与网上描述不符、商品存在质量问题等情形时，您应积极与中标买家沟通协商并保证中标买家的权益。对于中标买家因前述问题提出的退货要求，您应积极处理。
    8.3您同意根据如来云商页面提示或中标买家要求，准确提供并及时更新您的退货地址及退货收件人姓名、联系方式等退货信息，使之真实、及时、完整和准确。如因您提供的退货地址、退货收件人等退货信息错误、不实、过时或不完整，而导致退货之商品发生毁损或灭失风险，则该风险及因此产生的直接或间接支出应由您自行承担。
    8.4您同意当如来云商受理中标买家提出的消费者保障服务维权和赔付申请时，您应积极配合，在如来云商要求的时间期限内提供相关证据材料，以证明与中标买家交易的商品不存在中标买家提出的问题或符合双方的约定，并保证所提交的证据材料真实、合法。<strong>如如来云商以普通或非专业人员的知识水平标准，对您和/或中标买家提供的证据材料进行表面审核后，以其独立判断您未全面履行消费者保障服务内容导致中标买家权益受损，且在中标买家直接要求您处理未果的，则如来云商可根据本协议及其它公示规则的规定，在您的如来云商账户中扣除相应金额保证金款项，或者使用您如来云商账户中的余额赔付给中标买家。</strong>

    第九条  免责及有限责任
    9.1本协议项下的招标投标活动的技术服务将按“现状”和按“可得到”的状态提供，如来云商将在现有技术的基础上尽最大努力提供相应的安全措施以保障服务安全和正常运行。但<strong>由于可能存在的计算机病毒、网络通讯故障、系统维护等方面的因素以及可能发生的不可抗力事件，如来云商在此明确声明对技术服务不作任何明示或暗示的保证，包括但不限于对服务的可适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。</strong>对此卖家予以理解并不应要求如来云商在以下情况下承担责任：
    9.1.1系统停机维护；
    9.1.2通讯终端或电信设备出现故障不能进行数据传输的；
    9.1.3因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成系统障碍不能提供服务的；
    9.1.4由于黑客攻击、电信部门技术调整或故障、网站升级、第三方问题等原因而造成的服务中断或者延迟。
    <strong>9.2如来云商仅向您提供招标投标活动的技术信息服务以便您与买家之间达成招标品的相关交易，如来云商并非交易的参与方，不对您向买家的任何口头、书面陈述或者向如来云商上传的线上信息及招标品之真实性、合法性做任何明示或暗示的担保，或对此承担任何责任。如因招标品交易产生纠纷的，均由您以自己的名义独立承担所有相应的法律责任。</strong>

    第十条  违约责任
    10.1您应履行成交必卖承诺，即须按招标品的成交价格、数量、发货地点售出招标品并承担发货运费（涉及特殊约定的除外）。如因您违反上述承诺引发中标买家投诉，经如来云商判定您成交不卖行为成立的，如来云商将在释放中标买家竞标时锁定的保证金的同时，依据《【如来云商招标投标活动管理规则】》从您的经营保证金中划扣中标买家竞标时锁定的保证金数额的一定倍数的资金至中标买家如来云商钱包账户用以赔付中标买家。您对于上述资金划扣不持异议。
    10.2您明确理解并同意，如因您违反有关法律法规或者本协议之规定，使如来云商遭受任何损失、受到用户、任何第三方的索赔或任何行政管理部门的处罚，您应对如来云商进行全额赔偿，包括合理的律师费用。
    10.3除本协议另有约定外，任何一方违反其于本协议项下的陈述、承诺、保证或义务，而使另一方遭受任何诉讼、纠纷、索赔、处罚等的，违约方应负责解决，使另一方发生任何费用、额外责任或遭受经济损失的，应当负责赔偿。如一方发生违约行为，守约方可以书面通知方式要求违约方在指定的时限内停止违约行为，要求其消除影响。如违约方未能按时停止违约行为，则守约方有权立即终止本协议。<strong>如因如来云商自身原因造成您的损失，如来云商向您承担的最大总体责任和赔偿限额不应超过在本协议项下如来云商已向您收取的技术服务费总额。</strong>

    第十一条  协议终止及转让
    <strong>11.1本协议在符合以下任意一项情形时终止：</strong>
    <strong>11.1.1自然终止：如您在线签署的《如来云商用户注册协议》因任何原因终止，则本协议将同时终止；</strong>
    <strong>11.1.2通知解除：如来云商可提前15天以书面通知的方式终止本协议而无须承担违约责任；</strong>
    <strong>11.1.3单方解除权：出现下列情况之一的，如来云商有权立刻终止本协议，且按有关规则对您进行处罚：</strong>
    <strong>（1）您违反本协议中的任何承诺或保证，包括但不限于本协议项下的任何约定；</strong>
    <strong>（2）您违反如来云商的相关条款、协议、规则、通告等相关规定，而被如来云商终止提供服务的；</strong>
    <strong>（3）您被如来云商清退出招标活动的。</strong>
    <strong>10.1.4如非因如来云商的原因，您未能按本协议之规定，按时全额支付有关技术服务费用，且在如来云商规定的时限内仍未支付，如来云商有权部分或全部中止或终止本协议；</strong>
    <strong>11.1.5本协议规定的其它协议终止条件发生或实现，导致本协议终止。</strong>
    <strong>11.2协议终止后有关事项的处理：</strong>
    <strong>11.2.1无论本协议因何原因终止，在协议终止前的行为所导致的任何责任，协议各方必须完全且独立地承担；</strong>
    <strong>11.2.2协议终止后，如来云商有权保留您的注册数据及以前的交易行为记录。如您在协议终止前在如来云商存在违法或违反协议的行为，如来云商仍可行使本协议所约定的权利；</strong>
    <strong>11.2.3协议终止之前：</strong>
    <strong>（1）您已经发布至招标平台的招标品尚未达成交易的，如来云商有权在本协议终止时同时删除此项招标品的相关信息；</strong>
    <strong>（2）您已经与中标买家就招标品达成交易的，如来云商可以不删除该项交易，但如来云商有权在协议终止的同时将协议终止的情况通知该交易中的中标买家。</strong>
    <strong>11.3如来云商有权将本协议项下的全部权利和义务转让予第三方，而无须征得您的同意，届时如来云商将通过页面通知或公告等方式向您发出转让通知。</strong>

    第十二条  其他约定
    12.1本协议适用中华人民共和国大陆地区的法律、法规，如无相关规定的，则应参照通用中华人民共和国商业惯例和（或）行业惯例。
    12.2因如来云商与您就本协议的签订、履行或解释发生争议，双方应尽力友好协商解决；<strong>协商不成时，如来云商和您同意由如来云商住所地法院管辖审理双方的纠纷或争议。</strong>
    <strong>12.3招投标双方因招投标合同发生争议的，不应当将如来云商列为争议主体，届时如来云商有权引用本条作为主体不适格抗辩，任何一方对此将不持异议。</strong>
    `;
    export default {
        name: 'xe-page-support',
        data() {
            return {
                itemData: []
            };
        },
        created() {
            this.itemDataFn();
        },
        methods: {
            itemDataFn() {
                let resText = txt.split(/\n\s*\n/g);
                let resArr = [];
                resText.forEach(item => {
                    let txtSplit = item.split(/\n/g);
                    let txtContent = [];
                    txtSplit.forEach((item, index) => {
                        if (index !== 0) {
                            txtContent.push({
                                text: item.trim()
                            });
                        }
                    });
                    resArr.push({
                        show: false,
                        title: txtSplit[0].trim(),
                        content: txtContent
                    });
                });
                this.itemData = resArr;
            }
        },
        components: {
            CollapseTransition
        }
    };
</script>
<style rel="stylesheet/scss" lang="scss">
    @import "../../static/styles/rules.scss";
    .m-support-top {
        padding: 40/$ppr 30/$ppr;
        h3 {
            font-size: 38/$ppr;
            font-weight: 600;
            text-align: center;
            margin-bottom: 30/$ppr;
        }
        p {
            margin: 15/$ppr 0;
            font-size: 24/$ppr;
            color: $text-666;
            line-height: 1.5;
        }
    }
    .m-support-item {
        &:first-child {
            border-top: 1/$ppr solid $border-color-e8e;
        }
        .item-content {
            border-bottom: 1/$ppr solid $border-color-e8e;
        }
    }
    .m-support-text {
        padding: 20/$ppr;
        background: #f5f5f5;
        font-size: 28/$ppr;
        p {
            padding: 8/$ppr 0;
            line-height: 1.5;
            color: #666;
        }
    }
</style>
