<template>
    <xe-layout>
        <view class="m-support-con">
            <view class="m-support-top">
                <h3>如来云商侵权投诉与申诉规则</h3>
                <p>本规则适用于如来云商上由用户发布的信息引发的侵权投诉及申诉处理。</p>
                <p>如来云商，系由河南如来云商络科技有限公司（下称"如来云商公司"）运营的网站（域名为www.xebest.com,包括PC端、移动端、微信端）。</p>
                <p>本规则根据《侵权责任法》、《信息网络传播权保护条例》等法律法规制定，旨在最大程度保护知识产权等各项合法权益，维护良好的平台行为秩序，本规则为《如来云商用户注册协议》的组成部分。</p>
            </view>
            <view>
                <view class="m-support-item" v-for="(item, index) in itemData" :key="index">
                    <view class="m-list-block" @click.prevent="item.show = !item.show">
                        <ul>
                            <li class="item-content item-link">
                                <view class="item-inner">
                                    <view class="item-title f32">{{item.title}}</view>
                                </view>
                            </li>
                        </ul>
                    </view>
                    <CollapseTransition>
                        <view class="m-support-text" v-show="item.show">
                            <p v-for="(content, cindex) in item.content" :key="cindex" v-html="content.text"></p>
                        </view>
                    </CollapseTransition>
                </view>
            </view>
        </view>
    </xe-layout>
</template>
<script type="text/ecmascript-6">
    import CollapseTransition from 'utils/collapse-transition';
    let txt = `1. 侵权通知
        1.1 权利人向平台提交通知
        若权利人认为第三方在如来云商提供的内容侵犯其合法权益，可按照以下要求提交相关材料进行投诉，通知如来云商公司：
        权利人应向如来云商公司提交书面通知材料，通知材料的内容应包括但不限于以下内容：
        1) 权利人主体信息和相关材料：包括权利人的姓名（公司名称）、联系方式、地址、营业执照（单位）或者身份证（个人）、相关授权证明等证明权利人主体资格的材料；
        2) 权利人要求删除或者断开链接的涉嫌侵权内容名称和网络地址（或包名）；
        3) 构成侵权的初步证明材料，包括：
        a) 权利人拥有权利的权属证明材料：包括但不限于相关有权机构颁发的版权证书、商标权证书、专利权证书、作品首次公开发表或发行日期证明材料、创作手稿、经权威机构签发的作品创作时间戳、作品备案证书等能证明权利人拥有相关权利的有效权属证明；
        b) 被投诉者提供的内容构成侵权的证明：包括但不限于被投诉方提供的内容构成对权利人的版权、商标权或专利权等侵害的有效证明材料及书面事实说明等。
        c) 提供侵权内容详情页面链接。
        4) 权利人保证，包含以下内容：权利人在通知中的陈述和提供的相关材料皆是真实、有效和合法的，并保证自行承担由此产生的全部法律责任，包括但不限于如来云商公司根据权利人的通知下架有关内容而给如来云商公司造成的任何损失。
        1.2 通知处理
        如来云商公司在收到通知后，将对通知进行形式审查，通知不符合前述要求的，权利人应在5个工作日内向如来云商公司补充提交有关证据材料或其他材料，权利人应予配合，权利人逾期未予补充完善通知的，如来云商公司将视该侵权通知无效。
        如通知符合前述要求的，如来云商公司将根据相关法律法规之规定尽快进行处理。

        2. 申诉通知
        2.1 被投诉方向平台提交申诉通知
        被投诉方在收到如来云商公司转送的权利人向如来云商公司提交的相关侵权投诉材料后，认为其提供的内容未侵犯权利人权利的，应按照以下的指引要求在五5个工作日内向如来云商公司提交书面反通知，反通知的内容应包括但不限于以下内容：
        1) 被投诉方主体信息和相关材料
        包括被投诉方的姓名（名称）、联系方式、地址及营业执照（单位）、身份证（个人）、相关授权证明等证明权利人主体资格的材料；
        2) 被投诉方要求
        被投诉方要求恢复的内容或链接对应的名称和具体网络地址；
        3) 不构成侵权的初步证明材料，具体包括：
        被投诉方拥有权利的证明材料：包括但不限于相关有权机构颁发的版权证书、商标权证书、专利权证书、作品首次公开发表或发行日期证明材料、创作手稿、经权威机构签发的作品创作时间戳、作品备案证书等能证明被投诉方拥有相关权利的有效权属证明；
        被投诉方提供的内容不构成侵权的证明材料：包括但不限于被投诉方提供的内容不构成版权、商标权或专利权等权利侵权的有效证明材料，书面不侵权理由及事实说明、生效司法文书等。
        4) 被投诉方保证
        被投诉方应在反通知中明确保证：被投诉方在反通知中的陈述和提供的相关材料皆是真实、有效和合法的，并保证自行承担由此产生的全部法律责任，包括但不限于如来云商公司根据被投诉方反通知保留或者恢复有关内容而给如来云商公司造成的任何损失。
        2.2 申诉处理
        如来云商公司在收到反通知后，将对反通知进行形式审查，反通知不符合前述要求的，被投诉方应在5个工作日内向如来云商公司补充提交有关证据材料或其他材料，被投诉方应予配合，被投诉方逾期未予补充完善反通知的，如来云商公司将视该反通知无效。
        如通知符合前述要求的，如来云商公司将根据相关法律法规之规定尽快进行处理，同时会将被投诉方提供的相关材料转送给权利人。

        3. 各方同意
        3.1 权利人指拥有版权、商标权、专利权等合法权益的原始所有人或经原始所有人合法授权的权利享有者，包括自然人、法人或其他组织等；被投诉方指在如来云商被权利人投诉侵权的内容发布者、传播者。
        3.2 投诉或申诉不满足法律规定或本规则规定的条件的，如来云商公司可以视为未提出投诉或申诉，并对此不做处理。
        3.3 如来云商公司并非有权处理纠纷的机关，对于知识产权等侵权并无专业判断能力，权利人和被投诉方同意如来云商公司依照一般公司的注意程度对相关争议独立做出判断和处理措施，并对此不持异议，且不因此追究如来云商公司的平台责任。
        3.4 在如来云商公司对一次投诉和申诉依法采取必要措施或处理后，如双方仍有异议，应采取起诉、举报、报案等正规法律途径解决，如来云商公司将依法按照有权机关处理结果给予最终处理，双方原则上无权在就同样的投诉或申诉重复向如来云商公司提出。
        3.5 为了确保投诉的真实性和有效性，权利人的书面通知及其他相关证明材料，原则上应提供原件，不能提供原件的，应提供复印件（在复印件上应有权利人的签字/签章），若材料涉外的，应按照法律的规定进行公证转递，并同时提供相应的公证转递材料。
        3.6 若有关方已经就争议事项向相关行政部门或司法机关提起行政投诉或诉讼的，请在提交通知时，将相关受理证明及提交行政部门或司法机关的证据材料一同提交给如来云商公司，这将有利于争议事项的处理。

        4. 通知、申诉提交通道
        相关材料提交如来云商公司的方式有以下两种：
        1) 将前述全部的纸质版本材料清晰扫描后通过电子邮件发送至如来云商公司指定的电子邮箱：【xy@hnxianyi.com】
        2) 通过邮寄的方式将前述书面通知及其他相关证明材料邮寄至如来云商公司指定的以下地点：
        地址：河南省郑州市【郑东新区东风南路七里河路交叉口绿地之窗B座31楼】
        联系电话：【400-662-6366】
    `;
    export default {
        name: 'xe-page-support',
        data() {
            return {
                itemData: []
            };
        },
        created() {
            this.itemDataFn();
        },
        methods: {
            itemDataFn() {
                let resText = txt.split(/\n\s*\n/g);
                let resArr = [];
                resText.forEach(item => {
                    let txtSplit = item.split(/\n/g);
                    let txtContent = [];
                    txtSplit.forEach((item, index) => {
                        if (index !== 0) {
                            txtContent.push({
                                text: item.trim()
                            });
                        }
                    });
                    resArr.push({
                        show: false,
                        title: txtSplit[0].trim(),
                        content: txtContent
                    });
                });
                this.itemData = resArr;
            }
        },
        components: {
            CollapseTransition
        }
    };
</script>
<style rel="stylesheet/scss" lang="scss">
    @import "../../static/styles/rules.scss";
    .m-support-top {
        padding: 40/$ppr 30/$ppr;
        h3 {
            font-size: 38/$ppr;
            font-weight: 600;
            text-align: center;
            margin-bottom: 30/$ppr;
        }
        p {
            margin: 15/$ppr 0;
            font-size: 24/$ppr;
            color: $text-666;
            line-height: 1.5;
        }
    }
    .m-support-item {
        &:first-child {
            border-top: 1/$ppr solid $border-color-e8e;
        }
        .item-content {
            border-bottom: 1/$ppr solid $border-color-e8e;
        }
    }
    .m-support-text {
        padding: 20/$ppr;
        background: #f5f5f5;
        font-size: 28/$ppr;
        p {
            padding: 8/$ppr 0;
            line-height: 1.5;
            color: #666;
        }
    }
</style>
