<template>
    <div class="m-support-con">
        <div class="m-support-top">
            <h3>如来云商支付服务协议</h3>
            <p>【概述及审慎阅读】</p>
            <p>本协议是如来云商、与如来云商合作的第三方支付公司（本公司）与您就支付服务所订立的有效合约，您通过网络页面点击确认或以其他方式接受本协议，即表示您与如来云商及与如来云商合作的第三方支付公司已达成协议并同意接受本协议的全部约定内容。在接受本协议前，请您仔细阅读本协议全部内容（特别是以粗体标注的内容）。如您不同意接受本协议的任意内容，请不要进行后续操作</p>
        </div>
        <div>
            <div class="m-support-item m-item-list" style="margin: 0" v-for="(item, index) in itemData" :key="index">
                <div class="m-list-block" @click.prevent="item.show = !item.show">
                    <ul>
                        <!-- <li class="item-content item-link">
                            <div class="item-inner">
                                <div class="item-title f32">{{item.title}}</div>
                            </div>
                        </li> -->
                        <li>
                             <div class="item-content item-link">
                                <div class="item-inner">
                                    <div class="item-text">{{item.title}}</div>
                                </div>
                            </div>
                        </li>
                    </ul>
                </div>
                <CollapseTransition>
                    <div class="m-support-text" v-show="item.show">
                        <p v-for="(content, cindex) in item.content" :key="cindex" v-html="content.text">
                        </p>
                    </div>
                </CollapseTransition>
            </div>
        </div>
    </div>
</template>
<script type="text/ecmascript-6">
    import CollapseTransition from 'utils/collapse-transition';
    export default {
        name: 'xe-page-support',
        data() {
            return {
                itemData: [
                    {
                        show: false,
                        title: '一、声明与承诺',
                        content: [
                            {
                                text: '1.本协议相关约定既对用户线上支付款项有效，也适用于用户线下支付款项。用户购买产品后，在履行如来云商的线上、线下付款行为时，需要严格按照本协议规定内容，履行支付的权利和义务。'
                            },
                            {
                                text: '2.用户同意，本公司和如来云商有权根据商业计划变化、政策变化、市场变化或其他情形随时对本协议内容进行单方面的变更，并以网站公告的方式予以公布，无需另行单独通知用户；若用户在本协议内容公告变更后继续使用本服务的，表示用户已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务；若用户不同意修改后的协议内容，用户应停止使用本服务。'
                            },
                            {
                                text: '3.用户保证，用户是具有完全民事行为能力的自然人，或者是具有合法经营资格的实体组织。用户保证使用本服务时具备完全的风险识别能力，用户在使用如来云商支付服务时，具备判断对方是否具有合法身份、判断交易背景是否真实、判断交易风险是否可控、判断是否与对方进行交易、判断是否转账给对方的能力，且用户应自行承担与此相关的所有风险。'
                            },
                            {
                                text: '4、您应确保您是使用本服务的银行卡持有人，可合法、有效使用该银行卡且未侵犯任何第三方合法权益，否则因此造成本公司、如来云商、持卡人损失的，您应负责赔偿并承担全部法律责任，包括但不限于中止或终止为您提供支付服务等。您应确保开通本服务所提供的手机号码为本人所有，并授权本公司可以通过第三方渠道对您所提供手机号码的真实性、有效性进行核实。'
                            },
                            {
                                text: '5.用户授权，用户在如来云商上发生的所有交易，用户不可撤销地授权由如来云商按照本协议约定、法律法规、行业习惯等进行处理；同时，用户不可撤销地授权如来云商有权根据以上内容、内部处理规定或结合交易双方的证据和利益损益将争议款项的全部或部分支付给交易一方或双方，用户授权如来云商有权将用户账户内的资金暂时冻结，或者存放第三方支付渠道，待所有权利义务履行完毕且不存在纠纷后，再进行账户内资金的结算。因如来云商系统原因或者如来云商故意或重大过失以外原因造成的用户支付过程中的任何损失，如来云商不承担任何责任。用户使用如来云商支付服务时，用户仍应完全遵守本协议及如来云商制定的各项规则及页面提示等。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '二、如来云商在线支付服务概要',
                        content: [
                            {
                                text: '1.如来云商在线支付服务'
                            },
                            {
                                text: '用户须在如来云商直接注册绑定银行账户，并且按照相关银行卡绑定规定来绑定银行卡，按要求提供相关信息完成并经如来云商和本公司验证无误后方可使用本服务，本公司和如来云商严格按照银行管理规定以及相关法律关于线下付款的规定，确保用户资金安全其中包含：'
                            },
                            {
                                text: '（1）银行专管：用户在交易中所收取的货款通过银行专管，货款冻结在银行账户安全可靠。'
                            },
                            {
                                text: '（2）银行转账：货物送达买家完成签收并确认打款后，冻结在银行的货款将在约定期限内（遇双休/节假日顺延）自动结算给卖家。如买家已签收但未打款，货物送达收货地点后，约定期限内卖家有权授权银行从买家绑定的银行卡中扣划相应货款及费用。'
                            },
                            {
                                text: '（3）线下委托付款：用户选择货到付款的，由用户收到货物后将货款以现金或者转账的方式，支付至如来云商，如来云商根据用户所支付的款项，结算至交易对方。为确保专款专用，委托如来云商付款的需要有将款项交付如来云商或如来云商人员的凭证，证明用户确实已经委托如来云商支付款项。凭证包括但不限于产品订单号、支付对方主体、金额等。'
                            },
                            {
                                text: '2.账户安全'
                            },
                            {
                                text: '用户将对用户的账户和密码及使用账户进行的一切操作及言论负完全责任，用户同意：'
                            },
                            {
                                text: '（1）如来云商通过用户的如来云商登录名和密码识别用户的指示，用户应当妥善保管用户的如来云商登录名和密码及身份信息，用户自行承担因密码泄露、身份信息泄露所致的损失。用户保证不向其他任何人泄露用户的如来云商登录名及密码以及身份信息，亦不使用其他任何人的如来云商登录名及密码。本公司亦可能应用用户的设备识别用户的指示，用户应当妥善保管处于或应当处于用户掌控下的这些产品或设备，对于这些产品或设备遗失所致的任何损失，由用户自行承担。您在对使用本服务过程中发出指令的真实性及有效性承担全部责任；您承诺，本公司依照您的指令进行操作的一切风险由您承担。'
                            },
                            {
                                text: '（2）用户同意'
                            },
                            {
                                text: '①如用户发现有他人冒用或盗用用户的如来云商登录名及密码或任何其他未经合法授权之情形时，应立即以有效方式通知如来云商，要求如来云商暂停相关服务；'
                            },
                            {
                                text: '②确保用户在持续登录如来云商时段结束时，以正确步骤离开网站。本公司不能也不会对因用户未能遵守本款约定而发生的任何损失、损毁及其他不利后果负责。用户理解本公司对用户的请求采取行动需要合理期限，在此之前，本公司对已执行的指令及(或)所导致的用户的损失不承担任何责任。'
                            },
                            {
                                text: '③除非有法律规定或司法裁判，且征得如来云商同意，否则用户的如来云商登录名及密码、如来云商账户不得以任何方式转让或赠与。'
                            },
                            {
                                text: '④交易异常处理：用户使用本服务时同意并认可，可能由于银行本身系统问题、银行相关作业网络连线问题或其他不可抗拒因素，造成本服务无法提供。用户确保用户所输入的用户的资料无误，如果因资料错误造成本公司和如来云商于上述异常状况发生时，无法及时通知用户相关交易后续处理方式的，本公司和如来云商不承担任何损害赔偿责任。'
                            },
                            {
                                text: '⑤用户同意，基于运行和交易安全的需要，本公司和如来云商可以暂时停止提供或者限制本服务部分功能，或提供新的功能；在任何功能减少、增加或者变化时，只要用户仍然使用本服务，表示用户仍然同意本协议或者变更后的协议。'
                            },
                            {
                                text: '⑥如来云商有权了解用户使用本公司产品或服务的真实交易背景及目的，用户应如实提供本公司所需的真实、全面、准确的信息；如果本公司有合理理由怀疑用户提供虚假交易信息的，本公司有权暂时或永久限制用户所使用的产品或服务的部分或全部功能。'
                            },
                            {
                                text: '⑦如来云商禁止公司员工获取用户的账号密码，禁止公司员工代替用户登录账户或者代替操作下单、付款等，除非用户提前书面授权本公司员工或者其他第三人代替操作的，一切用户账户内的操作均视为用户本人操作'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '三、如来云商在线支付服务使用规则',
                        content: [
                            {
                                text: '为有效保障用户使用本服务时的合法权益，用户理解并同意接受以下规则：'
                            },
                            {
                                text: '1.如来云商可以通过手机短信和APP提示等方式，通知用户交易进展情况以及提示用户进行下一步的操作，但如来云商不保证用户能够收到或者及时收到该手机短信等，且不对此承担任何后果。因此，在交易过程中用户应当及时登录到本网站查看和进行交易操作。因用户没有及时查看和对交易状态进行修改或确认或未能提交相关申请而导致的任何纠纷或损失，本公司不负任何责任'
                            },
                            {
                                text: '2.如来云商对用户所交易的货物不提供任何形式的鉴定、证明的服务。除本协议另有规定外，如用户与交易对方发生交易纠纷，用户授权由本公司根据本协议及本网站上载明的各项规则进行处理。用户为解决纠纷而支出的通讯费、文件复印费、鉴定费等均由用户自行承担。因市场因素致使商品涨价跌价而使任何一方得益或者受到损失而产生的纠纷，如来云商不予处理；同时无论何方得益或受损也与当期订单的支付金额无关。'
                            },
                            {
                                text: '3.若用户未通过实名认证，用户将无法完成如来云商平台订单的正常支付。'
                            },
                            {
                                text: '4.如来云商并非银行或其它金融机构，本服务也非金融业务，本协议项下的资金移转通过线上或者线下方式实现，你理解并同意用户的资金于流转途中的合理时间。'
                            },
                            {
                                text: '5.在用户注册成为如来云商用户时，用户授权本公司通过银行或向第三者审核用户的身份和资格，并通过如来云商取得关于用户使用本服务的相关资料。'
                            },
                            {
                                text: '6.用户使用本服务进行交易时，用户即授权本公司将用户的个人信息和交易信息披露给与用户交易的另一方，该信息包括但不限于：用户的真实姓名、联系方式、信用状况。'
                            },
                            {
                                text: '7.用户不得将本服务用于非本公司许可的其他用途。 如您存在涉嫌通过如来云商账户进行虚假交易或盗用他人银行卡、未经许可使用他人的如来云商支付账户下的资金等侵犯法律法规的规定或有违公序良俗的情形，本公司和如来云商有权无须经您同意即限制您对您的如来云商支付账户及相关资金的操作权限，并撤销相关交易，直至本公司、如来云商或相关司法机关完成对您的核查。在对您或您的交易进行核查时，您应当按照要求提供您的相关身份证件、交易凭证和其他必要的凭证。如来云商有权对相关交易行为、核查结果进行记录并予以公布。在如来云商怀疑您的账户使用存在异常的情况下，您授权本公司和如来云商暂时冻结您的账户，以核实您的账户交易安全情况，本公司和如来云商对冻结您账户期间给您造成的损失不承担责任。'
                            },
                            {
                                text: '8.交易风险'
                            },
                            {
                                text: '①在使用本服务时，若用户或用户的交易对方未遵从本服务条款或网站说明、交易页面中之操作提示、规则），则本公司和如来云商有权拒绝为用户与交易对方提供相关服务，且本公司不承担损害赔偿责任。'
                            },
                            {
                                text: '②因用户的过错导致的任何损失由用户自行承担，该过错包括但不限于：不按照交易提示操作，未及时进行交易操作，遗忘或泄漏密码，密码被他人破解，用户使用的计算机被他人侵入。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '四、如来云商在线支付服务使用限制',
                        content: [
                            {
                                text: '1.用户在使用本服务时应遵守中华人民共和国相关法律法规、用户所在国家或地区之法令及相关国际惯例，不将本服务用于任何非法目的（包括用于禁止或限制交易物品的交易），也不以任何非法方式使用本服务。'
                            },
                            {
                                text: '2.用户不得利用本服务从事侵害他人合法权益之行为，否则本公司和如来云商有权拒绝提供本服务，且用户应承担所有相关法律责任，因此导致本公司、如来云商或如来云商员工受损的，用户应承担赔偿责任。上述行为包括但不限于：'
                            },
                            {
                                text: '①侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益。'
                            },
                            {
                                text: '②违反依法定或约定之保密义务。'
                            },
                            {
                                text: '③冒用他人名义使用本服务。'
                            },
                            {
                                text: '④从事不法交易行为，如洗钱、融资等其他本公司认为不得使用本服务进行交易的行为等。'
                            },
                            {
                                text: '⑤提供赌博资讯或以任何方式引诱他人参与赌博。'
                            },
                            {
                                text: '⑥非法使用他人银行账户或无效银行账号交易。'
                            },
                            {
                                text: '⑦违反《银行卡业务管理办法》使用银行卡。'
                            },
                            {
                                text: '⑧进行与用户或交易对方宣称的交易内容不符的交易，或不真实的交易。'
                            },
                            {
                                text: '⑨从事任何可能含有电脑病毒或是可能侵害本服务系统、资料之行为。'
                            },
                            {
                                text: '⑩其他本公司有正当理由认为不适当之行为。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '五、系统中断或故障',
                        content: [
                            {
                                text: '系统因下列状况无法正常运作，使用户无法使用各项服务时，本公司和如来云商不承担损害赔偿责任，该状况包括但不限于：'
                            },
                            {
                                text: '1.本公司在本网站公告之系统停机维护期间。'
                            },
                            {
                                text: '2.电信设备出现故障不能进行数据传输的。'
                            },
                            {
                                text: '3.因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本公司系统障碍不能执行业务的。'
                            },
                            {
                                text: '4.由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '六、责任范围及责任限制',
                        content: [
                            {
                                text: '1.本公司和如来云商仅对本协议中列明的责任承担范围负责。'
                            },
                            {
                                text: '2.用户明确因交易所产生的任何风险应由用户与交易对方承担。'
                            },
                            {
                                text: '3.如来云商用户信息是由用户本人自行提供的，如来云商无法保证该信息之准确、及时和完整，用户应对用户的判断承担全部责任。'
                            },
                            {
                                text: '4.在法律允许的情况下，如来云商对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使事先已被告知此等损失的可能性。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '七、法律适用与管辖',
                        content: [
                            {
                                text: '本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，没有相关法律规定的，参照一般习惯或行业惯例。因本协议产生之争议，均应向河南如来云商络科技有限公司住所地人民法院提起诉讼，并依照中华人民共和国法律予以处理。'
                            }
                        ]
                    }
                ]
            };
        },
        components: {
            CollapseTransition
        }
    };
</script>
<style rel="stylesheet/scss" lang="scss">
    @import "../../static/styles/rules.scss";
    .m-support-top {
        padding: 40/$ppr 30/$ppr;
        h3 {
            font-size: 38/$ppr;
            font-weight: 600;
            text-align: center;
            margin-bottom: 30/$ppr;
        }
        p {
            margin: 15/$ppr 0;
            font-size: 24/$ppr;
            color: #666;
            line-height: 1.5;
        }
    }
    .m-support-text {
        padding: 20/$ppr;
        background: #f5f5f5;
        font-size: 28/$ppr;
        p {
            padding: 8/$ppr 0;
            line-height: 1.5;
            color: #666;
        }
    }
</style>
