<template>
    <xe-layout>
        <view class="m-support-con">
            <view class="m-support-top">
                <h3>如来云商用户注册协议</h3>
                <p>欢迎您与如来云商所有者共同签署《如来云商用户注册协议》并使用如来云商平台服务。本协议具有合同效力，请您务必仔细阅读，特别是以黑体加粗形式提示您注意的条款。您一旦注册成功，本协议即构成有约束力的法律文件。</p>
            </view>
            <view>
                <view class="m-support-item" v-for="(item, index) in itemData" :key="index">
                    <view class="m-list-block" @click.prevent="item.show = !item.show">
                        <ul>
                            <li class="item-content item-link">
                                <view class="item-inner">
                                    <view class="item-title f32">{{item.title}}</view>
                                </view>
                            </li>
                        </ul>
                    </view>
                    <CollapseTransition>
                        <view class="m-support-text" v-show="item.show">
                            <p v-for="(content, cindex) in item.content" :key="cindex" v-html="content.text">
                            </p>
                        </view>
                    </CollapseTransition>
                </view>
            </view>
        </view>
    </xe-layout>
</template>
<script type="text/ecmascript-6">
    import CollapseTransition from 'utils/collapse-transition';
    export default {
        name: 'xe-page-support',
        data() {
            return {
                itemData: [
                    {
                        show: false,
                        title: '01：定义',
                        content: [
                            {
                                text: '在本协议及本网站其它相关规定中所使用的下列词语，除另有说明以外，应具有以下含义：'
                            },
                            {
                                text: '1.1 如来云商/本网站：指如来云商网站（域名：xebest.com），包括PC端、移动端、微信端等。'
                            },
                            {
                                text: '1.2如来云商公司/本公司：指如来云商（www.xebest.com）的所有者，即河南如来云商络科技有限公司及其关联公司，是在政府部门依法许可或备案的经营主体。'
                            },
                            {
                                text: '1.3用户/您：指符合本协议所约定的条件，同意遵守如来云商各种规则、条款（包括但不限于本协议），并使用如来云商的机构或个人。包括商家（也称卖家、销售方）与买家。'
                            },
                            {
                                text: '1.4 买家：指在如来云商上浏览或购买商品/接受服务的用户。'
                            },
                            {
                                text: '1.5 商家：指符合如来云商的要求，成功入驻如来云商，使用如来云商出售商品或提供服务的用户（也称“卖家”）。'
                            },
                            {
                                text: '1.6如来云商商城：系指如来云商整个交易平台。'
                            },
                            {
                                text: '1.7如来云商商铺：指卖家认证成功后，如来云商为其提供的用于展示品牌、发布信息、销售商品的电子商铺。'
                            },
                            {
                                text: '1.8如来云商账号/登陆名：是本网站向您提供服务时，由您在如来云商按照注册流程注册而获得，用于标示、识别或管理您自身信息，及您发布或获得的信息的唯一号码。'
                            },
                            {
                                text: '1.9订单：指买家向卖家同一时间买下单款或多款商品/服务的合约，订单中针对任一款商品/服务的内容构成独立的交易。'
                            },
                            {
                                text: '1.10评价：指用在线交易完成后，交易双方对交易服务情况作出的评述，评价记录是如来云商用户交易状况的重要标记，用户在进行评价时应保证所作评价公正、客观、真实。'
                            },
                            {
                                text: '1.11 处罚：指用户因自身违规行为而被如来云商公司采取的整治措施，具体种类包括：警告、限制使用、关闭账户、商品下架、删除等。'
                            },
                            {
                                text: '1.12服务：如来云商基于互联网，以包含如来云商网站、客户端、微信端等在内的各种形态（包括未来技术发展出现的新的服务形态）向您提供的各项服务。'
                            },
                            {
                                text: '1.13平台规则：包括在所有如来云商已经发布及后续发布的全部规则、实施细则、产品说明、公告等。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '02：协议接纳',
                        content: [
                            {
                                text: '2.1如来云商的各项电子服务的所有权和运营权归如来云商公司所有。您同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。本协议为电子形式的协议，是您与如来云商公司之间权利义务关系之约定，对双方均具有法律约束力。'
                            },
                            {
                                text: '2.2本协议内容包括本协议正文、法律声明、隐私权政策、交易规则及所有如来云商已经发布或将来可能发布的各类规则、公告、通知。所有规则为协议不可分割的组成部分，与协议正文具有同等法律效力。'
                            },
                            {
                                text: '2.3 您应当认真阅读本协议及上述各类规则，对于协议中粗体字的内容和涉及重要权益的内容，您应当加以重点阅读。如果您对本协议中的某一或某些条款产生疑问，您应当向如来云商公司咨询。如果您不同意本协议中的某一或某些条款，您应当立即停止使用如来云商。'
                            },
                            {
                                text: '2.4如来云商公司有权根据业务需要酌情修订本协议或各类规则，并以网站公告的形式进行更新，不再单独通知您。经修订的条款/规则一经在如来云商公布，即产生效力。如您不同意相关修订，请您立即停止使用服务。如您继续使用服务，则将视为您已接受经修订的条款/规则，如您与如来云商公司发生争议，应以最新的条款/规则为准。'
                            },
                            {
                                text: '2.5用户保证是具有完全民事行为能力的自然人，或者是具有合法经营资格的公司、个体工商户、组织机构等。用户保证使用本服务时具备完全的风险识别能力，用户在使用如来云商支付服务时，具备判断对方是否具有合法身份、判断交易背景是否真实、判断交易风险是否可控、判断是否与对方进行交易、判断是否转账给对方的能力，且用户应自行承担与此相关的所有风险。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '03：注册',
                        content: [
                            {
                                text: '3.1 服务使用对象'
                            },
                            {
                                text: '3.1.1 如来云商的服务对象仅限于依据中华人民共和国法律规定具有完全民事行为能力的自然人、法人及其他组织。若您不具备前述主体资格，请您停止注册或在监护人的参与下使用；如您代表一家公司或其他法律主体在如来云商注册，则您声明和保证，您有权使该公司或该法律主体受本协议的约束。如果您违反本项规定而进行注册，如来云商公司将有权注销您的账户。'
                            },
                            {
                                text: '3.1.2 您须自行配备使用互联网所需硬件和软件设备，自行负担与此相关的电话、网络等费用。'
                            },
                            {
                                text: '3.2 注册认定账户'
                            },
                            {
                                text: '3.2.1您应自行诚信提供注册认证资料，确保提供的注册认证资料真实、准确、完整、合法有效，您的注册认证资料如有变动的，应及时更新其注册认证资料。如果您提供的注册认证资料不合法、不真实、不准确、不详尽的，需承担因此引起的相应责任及后果，并且如来云商公司有权终止或限制您使用如来云商各项服务的权利。'
                            },
                            {
                                text: '3.2.2在您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他本公司允许的方式实际使用如来云商服务时，您即受本协议的约束。您可以使用您的注册用户名、您提供或确认的邮箱、手机号码或者本公司允许的其它登录方式进入如来云商。'
                            },
                            {
                                text: '3.2.3您了解并同意，如您系在本网站完成的注册程序，只要您注册成功，您即可以获得您的如来云商帐号，该帐号作为您使用如来云商服务的唯一身份标识。该账户的所有权归属于如来云商公司，您仅拥有使用权。您可以绑定银行卡，以开通在线支付功能。'
                            },
                            {
                                text: '3.2.4您愿意接受由如来云商公司以电子邮件、手机短信等方式发送的任何广告和其它商业信息。'
                            },
                            {
                                text: '3.2.5在完成注册或认定流程时，您应当按照法律法规要求，按相应页面的提示准确提供并及时更新您的资料，以使之真实、及时、完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，如来云商有权向您发出询问和/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部如来云商服务，如来云商对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。'
                            },
                            {
                                text: '3.3 如您为商家应按照商家入驻流程，向如来云商提出申请、提供资料、签订商家入驻协议，接受如来云商的审核。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '04：账户安全',
                        content: [
                            {
                                text: '4.1 您须自行负责对您的账户和密码保密，且须对该账户和/或密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。您同意：(1)如发现任何人未经授权使用您的账户和/或密码，或发生违反保密规定的任何其他情况，您应立即通知如来云商；(2) 确保您在每个上网时段结束时，以正确步骤离开网站。如来云商不会对因您未能遵守本款规定而发生的任何损失或损毁负责。您理解如来云商对您的请求采取行动需要合理时间，如来云商对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。'
                            },
                            {
                                text: '4.2您的如来云商账户、密码以及按约定仅供您独享的会员服务，未经如来云商公司同意不得向第三方转让、赠与或继承（与账户相关的财产权益除外）。本公司保留对不符合条件、违约或有其他不正当行为的用户终止或限制服务的权利。'
                            },
                            {
                                text: '4.3为使您更好地使用如来云商的各项服务，保障您的账户安全，如来云商可要求您按我国法律规定完成实名认证，具体以身份认证服务相关规则为准。'
                            },
                            {
                                text: '4.4如来云商禁止公司业务推广人员未经用户书面授权操作用户的账户或代用户进行下单、付款等操作行为。您应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、资金账户操作、订单操作、购买商品及服务及披露信息等）负责。您与第三人之间因委托关系或者其他合作关系导致的账户使用原因产生的纠纷，由您负责解决。'
                            },
                            {
                                text: '4.5您的账户为您自行设置并由您保管，如来云商员工任何时候均不会主动要求您提供您的账户密码。因此，建议您务必保管好您的账户，并确保您在每个上网时段结束时退出登录并以正确步骤离开如来云商。账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，如来云商并不承担责任，您应通过司法、行政等救济途径向侵权行为人追偿。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '05：服务终止',
                        content: [
                            {
                                text: '5.1您同意，如来云商公司有权在您违反相关平台规则及协议(包括但不限于如来云商认为您已违反本协议的字面意义和精神，或您以不符合本协议的字面意义和精神的方式行事)终止您的“服务”密码、账户 (或其任何部分) 或您对“服务”的使用。您进一步承认和同意，如来云商公司根据本协议规定终止您服务的情况下可立即使您的账户无效，或注销您的账户以及在您的账户内的所有相关资料和档案，禁止您进一步接入该等档案或“服务”。账户终止后，如来云商公司没有义务为您保留原账户中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给您或第三方。此外，您同意，如来云商公司不会就终止向您提供“服务”而对您或任何第三者承担任何责任。'
                            },
                            {
                                text: '5.2您有权向如来云商公司要求注销您的账户，如需要注销账户，需按照如来云商发布的注销规则和流程提出申请，经如来云商公司审核同意的，如来云商公司将注销您的账户，届时，您与如来云商公司基于本协议的合同关系即终止。您的账户被注销后，如来云商公司没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。'
                            },
                            {
                                text: '5.3 出现以下情况的，如来云商公司有权注销您的如来云商帐号，同时所有网站服务将被终止。（1）您连续三年未使用您的用户名、邮箱、手机或本网站认可的其他方式和密码登录过本网站。（2）未绑定通过实名认证的支付宝账户 。（3）不存在未到期的有效业务。'
                            },
                            {
                                text: '5.4 在下列情况下，如来云商公司有权通过注销用户账户的方式单方解除本协议：'
                            },
                            {
                                text: '5.4.1用户违反本协议相关规定时，如来云商公司有权暂停或终止向该用户提供服务。如该用户在如来云商公司暂停或终止提供服务后，再一次直接或间接或以他人名义注册为如来云商用户的，则如来云商公司有权再次暂停或终止向该用户提供服务。'
                            },
                            {
                                text: '5.4.2一经发现用户注册信息内容是虚假的，如来云商公司有权终止向该用户提供服务。'
                            },
                            {
                                text: '5.4.2一经发现用户注册信息内容是虚假的，如来云商公司有权终止向该用户提供服务。'
                            },
                            {
                                text: '5.4.4用户在如来云商有欺诈、发布或销售伪劣商品、侵权他人合法权益或其他严重违反任意本协议及如来云商规则的行为的。'
                            },
                            {
                                text: '5.4.5如来云商公司认为需终止提供服务的其他情况。'
                            },
                            {
                                text: '5.5 您理解并同意，您与如来云商公司的合同关系终止后：'
                            },
                            {
                                text: '5.5.1如来云商公司有权继续保存您的资料；'
                            },
                            {
                                text: '5.5.2您在使用服务期间存在违法行为、违反本协议或如来云商其他规则的行为的，如来云商公司仍可依据本协议向您主张权利。'
                            },
                            {
                                text: '5.5.3您在使用服务期间因使用服务与其他用户之间发生的关系，不因本协议的终止而终止，其他用户仍有权向您主张权利，您应继续按您的承诺履行义务。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '06：费用税收',
                        content: [
                            {
                                text: '如来云商公司保留根据协议或通过其他有效的方式告知后向服务的使用用户收取费用的权利。另外，您因进行交易、向如来云商公司获取有偿服务或接触如来云商服务器而发生的所有应纳税赋，以及相关硬件、软件、通讯、网络服务及其他方面的费用均由您自行承担。如来云商保留在无须发出书面通知，仅在网站公示的情况下，暂时或永久地更改或停止部分或全部“服务”的权利。如来云商对于您在平台内交易的税票开具不承担任何责任，您应当严格按照法律规定开具或者索取相关合法税票，不得偷税漏税。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '07：本网站的法律地位',
                        content: [
                            {
                                text: '7.1 如来云商仅作为用户在线寻求信息、磋商谈判、获取并进行交易相关服务的互联网交易平台。由于交易本身和互联网的特性，本公司无法控制交易对象、货物信息的合法性与真实性，请您在使用本网站提供的在线交易服务与第三方进行交易时小心谨慎，并意识到在交易中存在着包括欺诈、亏损在内的商业风险。'
                            },
                            {
                                text: '7.2 如来云商公司是在线交易服务的提供者，未经用户同意，不会以任何方式干预用户之间的交易行为，亦不涉及因交易而产生的法律关系及法律纠纷。倘若您与一名或一名以上用户，或与您通过本公司网站获取其服务的第三者服务供应商发生争议，您免除如来云商公司在任何方面与该争议有关的损害赔偿等方面的责任。'
                            },
                            {
                                text: '7.3 如来云商公司如对用户的申诉进行受理，该处理行为的依据和处理标准均是用户使用本服务过程中的行为是否符合本协议或如来云商其他规则的约定，而非对用户之间的交易行为本身进行评价。'
                            },
                            {
                                text: '7.4 如来云商公司与您之间为独立订约人关系，本服务协议无意构成代理、行纪、居间或任何服务合同之外的法律关系。如来云商公司为用户提供的商铺、搜索引擎推广、广告展位等服务并不代表对该用户及其交易行为做出承诺和担保。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '08：用户资料规则',
                        content: [
                            {
                                text: '8.1 您应对在如来云商上发布的个人、企业资料、货物描述以及其他任何信息负责，不得发布不真实、有歧义、有误导性或恶意的信息，您应当对自己的交易行为的真实性负责。'
                            },
                            {
                                text: '8.2 您保证提交的商铺信息、商品信息、网站内容等不含有任何违反国家有关法律、法规及中华人民共和国承认或加入的国际条约的内容，包括但不限于危害国家安全、淫秽色情、虚假、违法、诽谤（包括商业诽谤）、非法恐吓或非法骚扰、侵犯他人知识产权、人身权或其他合法权益或利益以及有违公序良俗的内容或指向这些内容的链接。'
                            },
                            {
                                text: '8.3如来云商公司如发现您提供的用户资料中包含有非法或虚假的信息，将有权采取删除、屏蔽、断开链接等必要措施进行处理，并保留中止或终止其用户资格、服务并追究其他责任的权利。'
                            },
                            {
                                text: '8.4您同意，未经如来云商公司事先书面授权，您不得对本网站上展示的任何资料作商业性利用，包括但不限于在未经本事先书面批准的情况下，对在本网站上展示的任何资料进行复制、采集等。'
                            },
                            {
                                text: '8.5您在享受服务的同时应当遵守如来云商的要求，保证不违反中华人民共和国法律法规以及对客户具有法律约束力的其他任何文件，也不构成对任何第三人任何形式的侵权，保证注册或使用网络推广技术服务时不具有非法意图或任何恶意，保证如来云商不会因向您提供本服务而构成违法、违约或者对任何第三人的侵权、或面临或被牵涉进任何第三人提出的诉讼、索赔等；如上述事件发生，承诺补偿如来云商因该事件而发生的任何损失（包括但不限于诉讼费、律师费、赔偿金等）'
                            },
                            {
                                text: '8.6倘若如来云商公司认为您的用户资料可能使本公司及其关联公司承担任何法律或道义上的责任，或可能使如来云商公司(全部或部分地)失去如来云商的互联网服务供应商或其他供应商的服务，则如来云商公司可自行全权决定对该资料采取认为必要或适当的任何行动，包括但不限于删除该类资料。您特此保证，您对提交给如来云商公司的用户资料拥有全部权利。您确认，如来云商公司没有责任去认定或决定您提交的资料哪些是应当受到保护的，对享有服务的其他用户使用您的用户资料，如来云商也不必负责。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '09：在线交易服务',
                        content: [
                            {
                                text: '9.1商品信息。如来云商上的商品价格、数量、是否有货等商品信息由商家发布，如来云商不向买家作特别通知。由于网站上商品信息的数量极其庞大，虽然本站会尽最大努力保证买家所浏览商品信息的准确性，但由于众所周知的互联网技术、商家失误等客观原因存在，网页显示的信息可能会有一定的滞后性或差错，对此情形买家应与商家核实。如来云商不对商品信息的准确性负责。'
                            },
                            {
                                text: '9.2商品价格。鉴于在互联网领域中商品价格可能具有商业机密性质的客观事实，商铺中陈列的商品价格信息仅供参考，但用户不得利用该客观事实对其他用户进行蒙蔽、欺诈从而获取不正当利益。如您通过如来云商在线交易服务购买商品/服务，请意识到部分商铺陈列的商品价格仅为指导价，实际成交价格需与商家询价沟通确定。'
                            },
                            {
                                text: '9.3订单。如您通过如来云商在线交易服务购买商品，在您下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与用户本人不一致的，收货人的行为和意思表示视为用户的行为和意思表示，用户应对收货人的行为及意思表示的法律后果承担连带责任。'
                            },
                            {
                                text: '9.4信息规则。如来云商公司欢迎并鼓励您根据如来云商要求发布信息、进行评论。但是，在如来云商网站上所进行的一切言论行为均属于您的个人行为，与如来云商公司无关。为保障网络信息安全，您在进行言论行为时，应当遵守国家相关法律法规的规定，不得制作、复制、发布、传播含有下列内容的信息：（1）违反宪法所确定的基本原则的；（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；（3）损害国家荣誉和利益的；（4）煽动民族仇恨、民族歧视，破坏民族团结的；（5）破坏国家宗教政策，宣扬邪教和封建迷信的；（6）散布谣言，扰乱社会秩序，破坏社会稳定的；（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；（8）侮辱或者诽谤他人，侵害他人合法权益的；（9）含有法律、行政法规禁止的其他内容的。'
                            },
                            {
                                text: '9.5用户经由如来云商取得的建议和资讯，无论其形式表现为何，皆不代表如来云商公司对某一用户或其资讯作出承诺。'
                            },
                            {
                                text: '9.6不得操纵交易。您同意不利用帮助实现蒙蔽或欺骗意图的同伙(下属的客户或第三方)，操纵与另一交易方所进行的商业谈判的结果。'
                            },
                            {
                                text: '9.7不得干扰交易系统。您同意，您不得使用任何装置、软件或例行程序干预或试图干预如来云商的正常运作或正在如来云商上进行的任何交易。您不得采取对任何将不合理或不合比例的庞大负载加诸如来云商络结构的行动。'
                            },
                            {
                                text: '9.8若您涉嫌发生上述交易服务规则的禁止性行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保如来云商公司免责。'
                            },
                            {
                                text: '9.9经生效法律文书确认或者如来云商公司自行判断用户涉嫌存在违法或违反本协议行为的，如来云商公司有权在如来云商上以网络发布形式公布用户的违法行为并做出处罚（包括但不限于限权、终止服务等）。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '10：在线交易服务争议及处理',
                        content: [
                            {
                                text: '10.1 根据本合同第七条，如来云商并不参与用户之间的交易行为，但如来云商有权受理并调处您与其他用户在使用在线交易服务过程中发生的争议，同时有权单方面独立判断其他用户对您的投诉及(或)索偿是否成立。若如来云商公司判断索偿成立，则您应及时使用自有资金进行偿付，否则如来云商公司有权扣减已购本公司及其关联公司的产品或服务中未履行部分的费用的相应金额或您在如来云商所有账户下的其他资金(或权益)等进行相应偿付。如来云商公司先与您履行了先行赔付义务的，您应及时赔偿如来云商的全部损失，否则如来云商公司有权通过前述方式抵减相应资金或权益，如仍无法弥补如来云商损失，则如来云商保留继续追偿的权利。'
                            },
                            {
                                text: '10.2 因如来云商公司非司法机构，您完全理解并承认，如来云商公司对证据的鉴别能力及对纠纷的处理能力有限，受理申诉完全是基于您的委托，不保证争议处理结果符合您的期望，亦不对争议处理结果承担任何责任。如来云商公司有权决定是否参与争议的调处。'
                            },
                            {
                                text: '10.3 如来云商公司有权通过电子邮件或其他联系方式向您了解与该争议有关的情况，并将所了解的情况通过电子邮件等方式通知对方，您有义务配合如来云商公司的工作，否则如来云商公司有权做出对您不利的处理结果。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '11：您授予的许可使用权',
                        content: [
                            {
                                text: '您完全理解并同意不可撤销地授予如来云商公司及其关联公司下列权利：'
                            },
                            {
                                text: '11.1 对于您提供的资料及交易信息，您授予如来云商公司及其关联公司通用的、永久的、免费的许可使用权利 (并有权在多个层面对该权利进行再授权)，使如来云商公司及其关联公司有权(全部或部份地) 使用、复制、修订、改写、发布、翻译、分发、执行和展示"您的资料"或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将"您的资料"纳入其他作品内。'
                            },
                            {
                                text: '11.2 当您违反本协议或与如来云商公司签订的其他协议的约定，如来云商公司有权以任何方式通知关联公司，要求其对您的权益采取限制措施包括但不限于将您绑定的银行卡账户内的款项支付给如来云商公司指定的对象，要求关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。'
                            },
                            {
                                text: '11.3 同样，当您向如来云商公司及其关联公司作出任何形式的承诺，且相关公司已确认您违反了该承诺，则如来云商公司有权立即按您的承诺约定的方式 对您的账户采取限制措施，包括但不限于中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，如来云商公司无须就相关情况与您核对事实，或另行征得您的同意，且如来云商公司无须就此限制措施或公示行为向您承担任何的责任。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '12：隐私',
                        content: [
                            {
                                text: '用户在如来云商填写的账户、密码、隐私以及其他一切非公开信息将得到严密保护，但有权要求披露的国家机关强制命令或按照法律规定如来云商应当披露的除外。具体隐私政策可以参考如来云商法律声明和隐私保护政策。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '13：责任范围和责任限制',
                        content: [
                            {
                                text: '13.1 您明确理解和同意，如来云商公司不对因下述任一情况而发生的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿 (无论如来云商公司是否已被告知该等损害赔偿的可能性)：(1) 使用或未能使用“服务”；(2) 因通过或从“服务”购买或获取任何货物、样品、数据、资料或服务，或通过或从“服务”接收任何信息或缔结任何交易所产生的获取替代货物和服务的费用；(3) 未经批准接入或更改您的传输资料或数据；(4) 任何第三者对“服务”的声明或关于“服务”的行为；或 (5) 因任何原因而引起的与“服务”有关的任何其他事宜，包括疏忽。'
                            },
                            {
                                text: '13.2如来云商公司会尽一切努力使您在使用如来云商的过程中得到满意。但如来云商不能随时预见到任何技术上的问题或其他困难。该等困难可能会导致数据损失或其他服务中断。为此，您明确理解和同意，您使用“服务”的风险由您自行承担，且“服务”以“按现状”和“按可得到 ”的状态提供。如来云商公司明确声明不作任何种类的明示或暗示的保证，包括但不限于关于适销性、适用于某一特定用途和无侵权行为等方面的保证。如来云商对下述内容不作保证：(1)“服务”会符合您的要求；(2)“服务”不会中断，且适时、安全和不带任何错误；(3) 通过使用“服务”而可能获取的结果将是准确或可信赖的；及 (4) 您通过“服务”而购买或获取的任何产品、服务、资料或其他材料的质量将符合您的预期。通过使用“服务”而下载或以其他形式获取任何材料是由您自行全权决定进行的，且与此有关的风险由您自行承担，对于因您下载任何该等材料而发生的您的电脑系统的任何损毁或任何数据损失，您将自行承担责任。您从如来云商或通过或从“服务”获取的任何口头或书面意见或资料，均不产生未在本协议内明确载明的任何保证责任。'
                            },
                            {
                                text: '13.3如来云商公司不能保证网站内的资讯或某一种描述会有一定数目的使用者来浏览，也不能保证会有一位特定的使用者来浏览。基于对国际互联网当今技术水平限制的共同理解，本网站并不保证所有信息、文本、图形、链接及其它项目的绝对准确性和完整性，故仅供访问者使用参考。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '14：赔偿',
                        content: [
                            {
                                text: '14.1 您同意，如因您违反本协议或经在此提及而纳入本协议的其他文件，或因您违反法律侵害了第三方的合法权利，或因您违反法律须承担行政或刑事责任，而使第三方或行政、司法机关对如来云商公司及其子公司、关联公司、分公司、董事、职员、代理人提出索赔或处罚要求（包括司法费用和其他专业人士的费用），您必须全额赔偿给如来云商公司及其子公司、关联公司、分公司、董事、职员、代理人，并使其免遭损失。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '15：通知',
                        content: [
                            {
                                text: '15.1如来云商通过您提供的联系方式向您发出通知，其中以电子的方式发出的书面通知，包括但不限于在如来云商公告，向您提供的联系电话发送手机短信，向您提供的电子邮件地址发送电子邮件，向您的账号发送信息、系统消息以及站内信信息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照您的用户地址交邮后的第五个自然日即视为送达。'
                            },
                            {
                                text: '15.2对于在如来云商上因交易活动引起的任何纠纷，您同意司法机关（包括但不限于人民法院）可以通过手机短信、电子邮件等现代通讯方式或邮寄方式向您送达法律文书（包括但不限于诉讼文书）。您指定接收法律文书的手机号码、电子邮箱等联系方式为您在如来云商注册、更新时提供的手机号码、电子邮箱联系方式，司法机关向上述联系方式发出法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。'
                            },
                            {
                                text: '15.3您同意司法机关可采取以上一种或多种送达方式向您达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。'
                            },
                            {
                                text: '15.4您同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于一审、二审、再审、执行以及督促程序等。'
                            },
                            {
                                text: '15.5你应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '16：不可抗力',
                        content: [
                            {
                                text: '16.1 “不可抗力”、“意外事件”是指无法预见、无法克服或避免的，且对客户、或如来云商公司造成重大影响的客观事件。包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等，以及社会事件，如战争、动乱、立法，政府行为等。客户同意：鉴于互联网的特殊性，如黑客攻击、网络中断等，凡出现非如来云商公司过错之网络问题的，均为不可抗力。'
                            },
                            {
                                text: '16.2 因不可抗力或者其他意外事件，使得本服务条款履行瑕疵或不能，如来云商公司不承担损害赔偿责任。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '17：保密条款',
                        content: [
                            {
                                text: '双方承诺在本协议执行过程中，对本协议内容及获悉的对方的商业秘密不得向第三方透露，否则应承担对方因此而致的损失。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '18：反商业贿赂',
                        content: [
                            {
                                text: '18.1 您及您所代表的机构保证不向如来云商公司人员或其亲属直接或间接允诺、给付任何贿赂或其它不正当利益，包括但不限于回扣、佣金、有价证券、实物、银行卡、存折、房屋装修、车辆购置或使用、借物办私事、不当出工出力、出资旅游、生日婚礼宴请的不当馈赠、不当招待或其它形式的好处，如如来云商公司发现您有贿赂行为，无论您是否因此获得实际利益，如来云商均有权立即终止服务。'
                            },
                            {
                                text: '18.2 若您发现如来云商公司人员有任何索贿受贿或其他营私舞弊行为，可以随时通过客服向如来云商公司举报。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '19：违约责任',
                        content: [
                            {
                                text: '19.1您同意赔偿因违反本协议而给如来云商公司造成的任何损失（包括但不限于经营损失、运输费、诉讼费、律师费、公证费、公告费、拍卖费、差旅费、调查取证费、处置费等）。如来云商不对用户张贴的资料承担任何责任(包括但不限于诽谤性的、攻击性的或非法的资料)，此类材料对其它用户造成的损失由用户自行承担全部责任。'
                            },
                            {
                                text: '19.2 您承诺，不会采取任何手段或措施（包括但不限于明示或暗示用户或通过其他方式转移其可以通过如来云商平台在线达成的交易，或达成交易后不经如来云商而直接收取交易金额）以规避向如来云商公司支付相关服务费用。否则将视为严重违约，如来云商公司将有权立即终止本协议，同时您需赔偿因此给如来云商公司造成的所有损失。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '20：法律及管辖',
                        content: [
                            {
                                text: '20.1 本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律、法规，如无相关规定的，则应参照通用中华人民共和国商业惯例和（或）行业惯例。'
                            },
                            {
                                text: '20.2因本协议或如来云商公司的服务所引起或与其有关的任何争议，双方应尽力友好协商解决；协商不成时，双方同意由如来云商所在地人民法院诉讼解决。'
                            }
                        ]
                    },
                    {
                        show: false,
                        title: '21：其他',
                        content: [
                            {
                                text: '21.1 用户除遵守本协议外还应遵守如来云商其他规则。'
                            },
                            {
                                text: '21.2 您同意如来云商公司因经营业务需要有权将本协议项下的权利义务部分或全部进行转让，而无须再通知予您并取得您的同意。'
                            },
                            {
                                text: '21.3 本协议所有条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度，不能作为本协议涵义解释的依据。'
                            },
                            {
                                text: '21.4 如来云商公司尊重您的合法权利，本协议及本网站上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户提供服务。如来云商公司欢迎用户和社会各界提出意见和建议，我们将虚心接受并适时修改本协议及本站上的各类规则。'
                            },
                            {
                                text: '21.5本协议中的任何条款无论因何种原因被视为完全或部分无效或不具有执行力，该条应视为可分的，不影响本协议的任何其余条款的有效性、约束力及可执行性。'
                            },
                            {
                                text: '21.6 您注册或者认证成为如来云商用户视为您完全接受本协议，在申请注册或认证之前请您再次确认已知悉并完全理解本协议的全部内容。'
                            }
                        ]
                    }
                ]
            };
        },
        components: {
            CollapseTransition
        }
    };
</script>
<style rel="stylesheet/scss" lang="scss">
    @import "../../static/styles/rules.scss";
    .m-support-top {
        padding: 40/$ppr 30/$ppr;
        h3 {
            font-size: 38/$ppr;
            font-weight: 600;
            text-align: center;
            margin-bottom: 30/$ppr;
        }
        p {
            margin: 15/$ppr 0;
            font-size: 24/$ppr;
            color: $text-666;
            line-height: 1.5;
        }
    }
    .m-support-item {
        &:first-child {
            border-top: 1/$ppr solid $border-color-e8e;
        }
        .item-content {
            border-bottom: 1/$ppr solid $border-color-e8e;
        }
    }
    .m-support-text {
        padding: 20/$ppr;
        background: #f5f5f5;
        font-size: 28/$ppr;
        p {
            padding: 8/$ppr 0;
            line-height: 1.5;
            color: #666;
        }
    }
</style>
